---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RoomTagType
source: html/69ece493-bfac-d3c5-8a80-b99081ed0733.htm
---
# Autodesk.Revit.DB.Architecture.RoomTagType

An object that represents a Room Tag type.

## Syntax (C#)
```csharp
public class RoomTagType : FamilySymbol
```